from django.core.management.base import BaseCommand, CommandError
from outgo.models import Subdivision


class Command(BaseCommand):

    subdivisions_set = [
        {'short': 'arhiv', 'full': 'архив'},
        {'short': 'garage', 'full': 'гараж управления финансов и тыла'},
        {'short': 'GIOS', 'full': 'группа информации и общественных связей'},
        {'short': 'GMPiTO', 'full': 'группа мобилизационной подготовки и территориальной обороны'},
        {'short': 'ohrana_truda', 'full': 'группа охраны труда управления финансов и тыла'},
        {'short': 'kafe', 'full': 'кафе'},
        {'short': 'kaf_ADOVD', 'full': 'кафедра административной деятельности органов внутренних дел ФМОБ'},
        {'short': 'kaf_BiL', 'full': 'кафедра белорусского и иностранных языков'},
        {'short': 'kaf_GiTP', 'full': 'кафедра гражданского и трудового права'},
        {'short': 'kaf_IP', 'full': 'кафедра информационного права ФКМ'},
        {'short': 'kaf_KiMP', 'full': 'кафедра конституционного и международного права'},
        {'short': 'kaf_KRIM', 'full': 'кафедра криминалистики'},
        {'short': 'kaf_KRIM_EXP', 'full': 'кафедра криминалистических экспертиз СЭФ'},
        {'short': 'kaf_ORD', 'full': 'кафедра оперативно-розыскной деятельности ФКМ'},
        {'short': 'kaf_PPFP', 'full': 'кафедра профессионально-прикладной физической подготовки'},
        {'short': 'kaf_PshihPed', 'full': 'кафедра психологии и педагогики'},
        {'short': 'kaf_RP', 'full': 'кафедра расследования преступлений СЭФ'},
        {'short': 'kaf_TCP', 'full': 'кафедра тактико-специальной подготовки'},
        {'short': 'kaf_TiIGP', 'full': 'кафедра теории и истории государства и права'},
        {'short': 'kaf_Yprava', 'full': 'кафедра уголовного права'},
        {'short': 'kaf_Yproc', 'full': 'кафедра уголовного процесса'},
        {'short': 'kaf_YIPiK', 'full': 'кафедра уголовно-исполнительного права и криминологии УИФ'},
        {'short': 'kaf_YOVD', 'full': 'кафедра управления органами внутренних дел ФПК и ПРК'},
        {'short': 'kaf_FiIR', 'full': 'кафедра философии и идеологической работы'},
        {'short': 'kaf_EB', 'full': 'кафедра экономической безопасности'},
        {'short': 'KEO', 'full': 'кафедра экономической безопасности'},
        {'short': 'shop', 'full': 'магазин'},
        {'short': 'MED', 'full': 'медицинская служба управления финансов и тыла'},
        {'short': 'MYC', 'full': 'международный учебный центр подготовки, повышения квалификации и переподготовки кадров в сфере миграции и противодействия торговле людьми'},
        {'short': 'NIO', 'full': 'научно-исследовательский отдел'},
        {'short': 'NPF', 'full': 'научно-педагогический факультет'},
        {'short': 'ODC', 'full': 'оперативно-дежурная служба'},
        {'short': 'OZGS', 'full': 'отдел защиты государственных секретов и документационного обеспечения'},
        {'short': 'OIR', 'full': 'отдел идеологической работы'},
        {'short': 'OK', 'full': 'отдел кадров'},
        {'short': 'OMTO', 'full': 'отдел материально-технического обеспечения'},
        {'short': 'OMC', 'full': 'отдел международного сотрудничества'},
        {'short': 'OOIT', 'full': 'отдел образовательных информационных технологий'},
        {'short': 'OOR', 'full': 'отдел организационной работы'},
        {'short': 'OPO', 'full': 'отдел правового обеспечения'},
        {'short': 'OPC', 'full': 'отдел психологического сопровождения'},
        {'short': 'telephone', 'full': 'отделение связи управления финансов и тыла'},
        {'short': 'RIO', 'full': 'редакционно-издательский отдел'},
        {'short': 'telephone', 'full': 'отделение связи управления финансов и тыла'},
        {'short': 'Management', 'full': 'руководство'},
        {'short': 'SEF', 'full': 'следственно-экспертный факультет'},
        {'short': 'cp-library', 'full': 'специальная библиотека'},
        {'short': 'YIF', 'full': 'уголовно-исполнительный факультет'},
        {'short': 'UMU', 'full': 'учебно-методическое управление'},
        {'short': 'sovet', 'full': 'ученый совет'},
        {'short': 'FKM', 'full': 'факультет криминальной милиции'},
        {'short': 'FMOB', 'full': 'факультет милиции общественной безопасности'},
        {'short': 'FPK_PRK', 'full': 'факультет повышения квалификации и переподготовки руководящих кадров'},
        {'short': 'FP', 'full': 'факультет права'},
        {'short': 'FEO', 'full': 'финансово-экономический отдел управления финансов и тыла'},
        {'short': 'CKVR', 'full': 'центр культурно-воспитательной работы'},
    ]

    def handle(self, *args, **options):
        try:
            Subdivision.objects.all().delete()
            for subdivision in self.subdivisions_set:
                Subdivision.objects.create(subdivision_name=subdivision['full'], subdivision_short_name=subdivision['short'])
        except:
            raise CommandError('Subdivisions init error')
